import pandas as pd

def preprocessing(df, ranktype):
    name_weapon = {
        '평균': ['평균'],
        '아델라': ['레이피어'],
        '아디나': ['아르카나'], 
        '아드리아나': ['투척'],
        '에이든': ['양손검'],
        '알렉스': ['4종'],
        '아야': ['권총', '돌격 소총', '저격총'],
        '바바라': ['방망이'],
        '버니스': ['저격총'],
        '비앙카': ['아르카나'],
        '카밀로': ['쌍검'],
        '캐시': ['단검'],
        '셀린': ['투척'],
        '키아라': ['레이피어'],
        '클로에': ['암기'],
        '다니엘': ['단검'],
        '에키온': ['VF의수'],
        '일레븐': ['망치'],
        '엠마': ['암기'],
        '이바': ['투척'],
        '펠릭스': ['창'],
        '피오라': ['레이피어', '창', '양손검'],
        '하트': ['기타'], 
        '혜진': ['활', '암기'],
        '현우': ['톤파', '글러브'],
        '아이솔': ['돌격 소총', '권총'],
        '재키': ['도끼', '양손검', '쌍검', '단검'],
        '얀': ['글러브'],
        '제니': ['권총'],
        '요한': ['아르카나'],
        '칼라': ['석궁'],
        '라우라': ['채찍'],
        '레녹스': ['채찍'],
        '레온': ['글러브'],
        '리 다이린': ['글러브', '쌍절곤'],
        '루크': ['방망이'],
        '매그너스': ['방망이', '망치'],
        '마이': ['채찍'],
        '마커스': ['도끼'],
        '나딘': ['활', '석궁'],
        '나타폰': ['카메라'],
        '니키': ['글러브'],
        '프리야': ['기타'],
        '리오': ['활'],
        '로지': ['권총'],
        '쇼이치': ['단검'],
        '실비아': ['권총'],
        '시셀라': ['암기', '투척'],
        '수아': ['망치'],
        '띠아': ['방망이'],
        '윌리엄': ['투척'],
        '쇼우': ['창', '단검'],
        '유키': ['양손검', '쌍검'],
        '자히르': ['투척', '암기'],
    }

    total_range = 0
    for i in name_weapon:
        total_range += len(name_weapon[i])

    collecting_date = df.iloc[4, 4]
    colnames = df.iloc[8, 2:19].values
    if ranktype == 'all':
        data = df.iloc[9:9+total_range+1, 2:19]
    else:
        data = df.iloc[9+total_range+7: 9+2*total_range+8, 2:19]
    data.columns = colnames
    data = data.fillna(method='ffill')
    data['캐릭터-무기'] = data['캐릭터'] + '-' + data['숙련도']
    data['캐릭터-무기'] = data['캐릭터-무기'].fillna('평균')
    return collecting_date, data